RTEMS/rtems/bsps/arm/lpc24xx/include/bsp/io.h
/**
 * @file
 *
 * @ingroup RTEMSBSPsARMLPC24XX_io
 *
 * @brief Input and output module.
 */

/*
 * Copyright (c) 2009-2012 embedded brains GmbH.  All rights reserved.
 *
 *  embedded brains GmbH
 *  Obere Lagerstr. 30
 *  82178 Puchheim
 *  Germany
 *  <rtems@embedded-brains.de>
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rtems.org/license/LICENSE.
 */

#ifndef LIBBSP_ARM_LPC24XX_IO_H
#define LIBBSP_ARM_LPC24XX_IO_H

#include <rtems.h>

#include <bsp/lpc24xx.h>

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/**
 * @defgroup lpc24xx_io IO Support and Configuration
 *
 * @ingroup RTEMSBSPsARMLPC24XX
 *
 * @brief Input and output module.
 *
 * @{
 */

#define LPC24XX_IO_PORT_COUNT 5U

#define LPC24XX_IO_INDEX_MAX (LPC24XX_IO_PORT_COUNT * 32U)

#define LPC24XX_IO_INDEX_BY_PORT(port, bit) (((port) << 5U) + (bit))

#define LPC24XX_IO_PORT(index) ((index) >> 5U)

#define LPC24XX_IO_PORT_BIT(index) ((index) & 0x1fU)

typedef enum {
  #ifdef ARM_MULTILIB_ARCH_V4
    LPC24XX_MODULE_ACF,
  #endif
    LPC24XX_MODULE_ADC,
  #ifdef ARM_MULTILIB_ARCH_V4
    LPC24XX_MODULE_BAT_RAM,
  #endif
  LPC24XX_MODULE_CAN_0,
  LPC24XX_MODULE_CAN_1,
  LPC24XX_MODULE_DAC,
  LPC24XX_MODULE_EMC,
  LPC24XX_MODULE_ETHERNET,
  LPC24XX_MODULE_GPDMA,
  LPC24XX_MODULE_GPIO,
  LPC24XX_MODULE_I2C_0,
  LPC24XX_MODULE_I2C_1,
  LPC24XX_MODULE_I2C_2,
  LPC24XX_MODULE_I2S,
  LPC24XX_MODULE_LCD,
  LPC24XX_MODULE_MCI,
  #ifdef ARM_MULTILIB_ARCH_V7M
    LPC24XX_MODULE_MCPWM,
  #endif
  LPC24XX_MODULE_PCB,
  LPC24XX_MODULE_PWM_0,
  LPC24XX_MODULE_PWM_1,
  #ifdef ARM_MULTILIB_ARCH_V7M
    LPC24XX_MODULE_QEI,
  #endif
  LPC24XX_MODULE_RTC,
  #ifdef ARM_MULTILIB_ARCH_V4
    LPC24XX_MODULE_SPI,
  #endif
  LPC24XX_MODULE_SSP_0,
  LPC24XX_MODULE_SSP_1,
  #ifdef ARM_MULTILIB_ARCH_V7M
    LPC24XX_MODULE_SSP_2,
  #endif
  LPC24XX_MODULE_SYSCON,
  LPC24XX_MODULE_TIMER_0,
  LPC24XX_MODULE_TIMER_1,
  LPC24XX_MODULE_TIMER_2,
  LPC24XX_MODULE_TIMER_3,
  LPC24XX_MODULE_UART_0,
  LPC24XX_MODULE_UART_1,
  LPC24XX_MODULE_UART_2,
  LPC24XX_MODULE_UART_3,
  #ifdef ARM_MULTILIB_ARCH_V7M
    LPC24XX_MODULE_UART_4,
  #endif
  #ifdef ARM_MULTILIB_ARCH_V4
    LPC24XX_MODULE_WDT,
  #endif
  LPC24XX_MODULE_USB
} lpc24xx_module;

#define LPC24XX_MODULE_COUNT (LPC24XX_MODULE_USB + 1)

typedef enum {
  LPC24XX_MODULE_PCLK_DEFAULT = 0x4U,
  LPC24XX_MODULE_CCLK = 0x1U,
  LPC24XX_MODULE_CCLK_2 = 0x2U,
  LPC24XX_MODULE_CCLK_4 = 0x0U,
  LPC24XX_MODULE_CCLK_6 = 0x3U,
  LPC24XX_MODULE_CCLK_8 = 0x3U
} lpc24xx_module_clock;

#define LPC24XX_MODULE_CLOCK_MASK 0x3U

typedef enum {
  LPC24XX_GPIO_DEFAULT = 0x0U,
  LPC24XX_GPIO_RESISTOR_PULL_UP = 0x0U,
  LPC24XX_GPIO_RESISTOR_NONE = 0x1U,
  LPC24XX_GPIO_RESISTOR_PULL_DOWN = 0x2U,
  LPC24XX_GPIO_INPUT = 0x0U,
  #ifdef ARM_MULTILIB_ARCH_V7M
    LPC17XX_GPIO_REPEATER = 0x3U,
    LPC17XX_GPIO_HYSTERESIS = IOCON_HYS,
    LPC17XX_GPIO_INPUT_INVERT = IOCON_INV,
    LPC17XX_GPIO_FAST_MODE = IOCON_SLEW,
    LPC17XX_GPIO_OPEN_DRAIN = IOCON_OD,
    LPC17XX_GPIO_INPUT_FILTER = IOCON_FILTER,
  #endif
  LPC24XX_GPIO_OUTPUT = 0x8000U
} lpc24xx_gpio_settings;

rtems_status_code lpc24xx_module_enable(
  lpc24xx_module module,
  lpc24xx_module_clock clock
);

rtems_status_code lpc24xx_module_disable(
  lpc24xx_module module
);

bool lpc24xx_module_is_enabled(lpc24xx_module module);

rtems_status_code lpc24xx_gpio_config(
  unsigned index,
  lpc24xx_gpio_settings settings
);

static inline void lpc24xx_gpio_set(unsigned index)
{
  if (index <= LPC24XX_IO_INDEX_MAX) {
    unsigned port = LPC24XX_IO_PORT(index);
    unsigned bit = LPC24XX_IO_PORT_BIT(index);

    LPC24XX_FIO [port].set = 1U << bit;
  }
}

static inline void lpc24xx_gpio_clear(unsigned index)
{
  if (index <= LPC24XX_IO_INDEX_MAX) {
    unsigned port = LPC24XX_IO_PORT(index);
    unsigned bit = LPC24XX_IO_PORT_BIT(index);

    LPC24XX_FIO [port].clr = 1U << bit;
  }
}

static inline void lpc24xx_gpio_write(unsigned index, bool value)
{
  if (value) {
    lpc24xx_gpio_set(index);
  } else {
    lpc24xx_gpio_clear(index);
  }
}

static inline bool lpc24xx_gpio_get(unsigned index)
{
  if (index <= LPC24XX_IO_INDEX_MAX) {
    unsigned port = LPC24XX_IO_PORT(index);
    unsigned bit = LPC24XX_IO_PORT_BIT(index);

    return (LPC24XX_FIO [port].pin & (1U << bit)) != 0;
  } else {
    return false;
  }
}

typedef enum {
  /**
   * @brief Sets the pin function.
   */
  LPC24XX_PIN_SET_FUNCTION,

  /**
   * @brief Checks if all pins are configured with the specified function.
   */
  LPC24XX_PIN_CHECK_FUNCTION,

  /**
   * @brief Configures the pins as input.
   */
  LPC24XX_PIN_SET_INPUT,

  /**
   * @brief Checks if all pins are configured as input.
   */
  LPC24XX_PIN_CHECK_INPUT
} lpc24xx_pin_action;

typedef union {
  struct {
    uint16_t port : 3;
    uint16_t port_bit : 5;
    uint16_t function : 3;
    uint16_t type : 4;
    uint16_t range : 1;
  } fields;
  uint16_t value;
} lpc24xx_pin_range;

typedef enum {
  LPC24XX_PIN_FUNCTION_00,
  LPC24XX_PIN_FUNCTION_01,
  LPC24XX_PIN_FUNCTION_10,
  LPC24XX_PIN_FUNCTION_11
} lpc24xx_pin_function;

typedef enum {
  LPC17XX_PIN_TYPE_DEFAULT,
  LPC17XX_PIN_TYPE_ADC,
  LPC17XX_PIN_TYPE_DAC,
  LPC17XX_PIN_TYPE_I2C,
  LPC17XX_PIN_TYPE_I2C_FAST_PLUS,
  LPC17XX_PIN_TYPE_OPEN_DRAIN,
  LPC17XX_PIN_TYPE_FAST_SLEW_RATE
} lpc17xx_pin_type;

#ifdef ARM_MULTILIB_ARCH_V4
  #define LPC24XX_PIN(p, i, f0, f1) { { p, i, f0, 0, 0 } }
  #define LPC24XX_PIN_WITH_TYPE(p, i, f0, f1, t) { { p, i, f0, t, 0 } }
  #define LPC24XX_PIN_RANGE(p, i, j, f0, f1) \
    { { p, i, f0, 0, 0 } }, { { p, j, f0, 0, 1 } }
  #define LPC24XX_PIN_RANGE_WITH_TYPE(p, i, j, f0, f1, t) \
    { { p, i, f0, t, 0 } }, { { p, j, f0, t, 1 } }
#else
  #define LPC24XX_PIN(p, i, f0, f1) { { p, i, f1, 0, 0 } }
  #define LPC24XX_PIN_WITH_TYPE(p, i, f0, f1, t) { { p, i, f1, t, 0 } }
  #define LPC24XX_PIN_RANGE(p, i, j, f0, f1) \
    { { p, i, f1, 0, 0 } }, { { p, j, f1, 0, 1 } }
  #define LPC24XX_PIN_RANGE_WITH_TYPE(p, i, j, f0, f1, t) \
    { { p, i, f1, t, 0 } }, { { p, j, f1, t, 1 } }
#endif

#define LPC24XX_PIN_TERMINAL { { 0x7, 0x1f, 0x7, 0xf, 0x1 } }

/**
 * @brief Performs the @a action with the @a pins
 *
 * @code
 * #include <assert.h>
 * #include <bsp/io.h>
 * 
 * void example(void)
 * {
 *   static const lpc24xx_pin_range pins [] = {
 *     LPC24XX_PIN_I2S_RX_CLK_P0_4,
 *     LPC24XX_PIN_I2S_RX_WS_P0_5,
 *     LPC24XX_PIN_I2S_RX_SDA_P0_6,
 *     LPC24XX_PIN_I2S_TX_CLK_P0_7,
 *     LPC24XX_PIN_I2S_TX_WS_P0_8,
 *     LPC24XX_PIN_I2S_TX_SDA_P0_9,
 *     LPC24XX_PIN_TERMINAL
 *   };
 *   rtems_status_code sc = RTEMS_SUCCESSFUL;
 * 
 *   sc = lpc24xx_module_enable(LPC24XX_MODULE_I2S, LPC24XX_MODULE_CCLK_8);
 *   assert(sc == RTEMS_SUCCESSFUL);
 *   sc = lpc24xx_pin_config(&pins [0], LPC24XX_PIN_SET_FUNCTION);
 *   assert(sc == RTEMS_SUCCESSFUL);
 * }
 * @endcode
 *
 * @retval RTEMS_SUCCESSFUL Successful operation.
 * @retval RTEMS_IO_ERROR Check failed.
 * @retval RTEMS_NOT_DEFINED Invalid action.
 */
rtems_status_code lpc24xx_pin_config(
  const lpc24xx_pin_range *pins,
  lpc24xx_pin_action action
);

/**
 * @brief Returns the first pin index of a pin range.
 */
static inline unsigned lpc24xx_pin_get_first_index(
  const lpc24xx_pin_range *range
)
{
  return LPC24XX_IO_INDEX_BY_PORT(range->fields.port, range->fields.port_bit);
}

/**
 * @name ADC Pins
 *
 * @{
 */

