RTEMS/rtems/bsps/arm/lpc24xx/include/bsp/io.h
#define LPC24XX_PIN_ADC_CHANNEL_0 \
  LPC24XX_PIN_WITH_TYPE(0, 23, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_1 \
  LPC24XX_PIN_WITH_TYPE(0, 24, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_2 \
  LPC24XX_PIN_WITH_TYPE(0, 25, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_3 \
  LPC24XX_PIN_WITH_TYPE(0, 26, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_4 \
  LPC24XX_PIN_WITH_TYPE(1, 30, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_5 \
  LPC24XX_PIN_WITH_TYPE(1, 31, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_6 \
  LPC24XX_PIN_WITH_TYPE(0, 12, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_ADC)
#define LPC24XX_PIN_ADC_CHANNEL_7 \
  LPC24XX_PIN_WITH_TYPE(0, 13, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_ADC)

/** @} */

/**
 * @name CAN 0 Pins
 *
 * @{
 */

#define LPC24XX_PIN_CAN_0_RD_P0_0 \
  LPC24XX_PIN(0, 0, LPC24XX_PIN_FUNCTION_01, 1)

#define LPC24XX_PIN_CAN_0_RD_P0_21 \
  LPC24XX_PIN(0, 21, LPC24XX_PIN_FUNCTION_11, 4)

#define LPC24XX_PIN_CAN_0_TD_P0_1 \
  LPC24XX_PIN(0, 1, LPC24XX_PIN_FUNCTION_01, 1)

#define LPC24XX_PIN_CAN_0_TD_P0_22 \
  LPC24XX_PIN(0, 22, LPC24XX_PIN_FUNCTION_11, 4)

/** @} */

/**
 * @name CAN 1 Pins
 *
 * @{
 */

#define LPC24XX_PIN_CAN_1_RD_P0_4 \
  LPC24XX_PIN(0, 4, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_CAN_1_RD_P2_7 \
  LPC24XX_PIN(2, 7, LPC24XX_PIN_FUNCTION_01, 1)

#define LPC24XX_PIN_CAN_1_TD_P0_5 \
  LPC24XX_PIN(0, 5, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_CAN_1_TD_P2_8 \
  LPC24XX_PIN(2, 8, LPC24XX_PIN_FUNCTION_01, 1)

/** @} */

/**
 * @name DAC Pins
 *
 * @{
 */

#define LPC24XX_PIN_DAC \
  LPC24XX_PIN_WITH_TYPE(0, 26, LPC24XX_PIN_FUNCTION_10, 2, LPC17XX_PIN_TYPE_DAC)

/** @} */

/**
 * @name Ethernet Pins
 *
 * @{
 */

#define LPC24XX_PIN_ETHERNET_MII \
  LPC24XX_PIN_RANGE(1, 0, 17, LPC24XX_PIN_FUNCTION_01, 1)

#define LPC24XX_PIN_ETHERNET_RMII_0 \
  LPC24XX_PIN_RANGE(1, 0, 1, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_ETHERNET_RMII_1 \
  LPC24XX_PIN(1, 4, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_ETHERNET_RMII_2 \
  LPC24XX_PIN_RANGE(1, 8, 10, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_ETHERNET_RMII_3 \
  LPC24XX_PIN_RANGE(1, 14, 17, LPC24XX_PIN_FUNCTION_01, 1)

/** @} */

/**
 * @name External Interrupt Pins
 *
 * @{
 */

#define LPC24XX_PIN_EINT_0 \
  LPC24XX_PIN(2, 10, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_EINT_1 \
  LPC24XX_PIN(2, 11, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_EINT_2 \
  LPC24XX_PIN(2, 12, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_EINT_3 \
  LPC24XX_PIN(2, 13, LPC24XX_PIN_FUNCTION_01, 1)

/** @} */

/**
 * @name External Memory Controller (EMC) Pins
 *
 * @{
 */

#define LPC24XX_PIN_EMC(p, i) \
  LPC24XX_PIN_WITH_TYPE(p, i, LPC24XX_PIN_FUNCTION_01, 1, \
    LPC17XX_PIN_TYPE_FAST_SLEW_RATE)

#define LPC24XX_PIN_EMC_RANGE(p, i, j) \
  LPC24XX_PIN_RANGE_WITH_TYPE(p, i, j, LPC24XX_PIN_FUNCTION_01, 1, \
    LPC17XX_PIN_TYPE_FAST_SLEW_RATE)

#define LPC24XX_PIN_EMC_CS_0 LPC24XX_PIN_EMC(4, 30)
#define LPC24XX_PIN_EMC_CS_1 LPC24XX_PIN_EMC(4, 31)
#define LPC24XX_PIN_EMC_CS_2 LPC24XX_PIN_EMC(2, 14)
#define LPC24XX_PIN_EMC_CS_3 LPC24XX_PIN_EMC(2, 15)

#define LPC24XX_PIN_EMC_DYCS_0 LPC24XX_PIN_EMC(2, 20)
#define LPC24XX_PIN_EMC_DYCS_1 LPC24XX_PIN_EMC(2, 21)
#define LPC24XX_PIN_EMC_DYCS_2 LPC24XX_PIN_EMC(2, 22)
#define LPC24XX_PIN_EMC_DYCS_3 LPC24XX_PIN_EMC(2, 23)

#define LPC24XX_PIN_EMC_OE LPC24XX_PIN_EMC(4, 24)
#define LPC24XX_PIN_EMC_WE LPC24XX_PIN_EMC(4, 25)
#define LPC24XX_PIN_EMC_CAS LPC24XX_PIN_EMC(2, 16)
#define LPC24XX_PIN_EMC_RAS LPC24XX_PIN_EMC(2, 17)

#define LPC24XX_PIN_EMC_CLK_0 LPC24XX_PIN_EMC(2, 18)
#define LPC24XX_PIN_EMC_CLK_1 LPC24XX_PIN_EMC(2, 19)

#define LPC24XX_PIN_EMC_CKE_0 LPC24XX_PIN_EMC(2, 24)
#define LPC24XX_PIN_EMC_CKE_1 LPC24XX_PIN_EMC(2, 25)
#define LPC24XX_PIN_EMC_CKE_2 LPC24XX_PIN_EMC(2, 26)
#define LPC24XX_PIN_EMC_CKE_3 LPC24XX_PIN_EMC(2, 27)

#define LPC24XX_PIN_EMC_DQM_0 LPC24XX_PIN_EMC(2, 28)
#define LPC24XX_PIN_EMC_DQM_1 LPC24XX_PIN_EMC(2, 29)
#define LPC24XX_PIN_EMC_DQM_2 LPC24XX_PIN_EMC(2, 30)
#define LPC24XX_PIN_EMC_DQM_3 LPC24XX_PIN_EMC(2, 31)

#define LPC24XX_PIN_EMC_BLS0 LPC24XX_PIN_EMC(4, 26)
#define LPC24XX_PIN_EMC_BLS1 LPC24XX_PIN_EMC(4, 27)
#define LPC24XX_PIN_EMC_BLS2 LPC24XX_PIN_EMC(4, 28)
#define LPC24XX_PIN_EMC_BLS3 LPC24XX_PIN_EMC(4, 29)

#define LPC24XX_PIN_EMC_D_0_15 LPC24XX_PIN_EMC_RANGE(3, 0, 15)
#define LPC24XX_PIN_EMC_D_15_31 LPC24XX_PIN_EMC_RANGE(3, 15, 31)
#define LPC24XX_PIN_EMC_D_0_31 LPC24XX_PIN_EMC_RANGE(3, 0, 31)

#define LPC24XX_PIN_EMC_A_0_12 LPC24XX_PIN_EMC_RANGE(4, 0, 12)
#define LPC24XX_PIN_EMC_A_0_13 LPC24XX_PIN_EMC_RANGE(4, 0, 13)
#define LPC24XX_PIN_EMC_A_0_14 LPC24XX_PIN_EMC_RANGE(4, 0, 14)
#define LPC24XX_PIN_EMC_A_0_15 LPC24XX_PIN_EMC_RANGE(4, 0, 15)
#define LPC24XX_PIN_EMC_A_0_16 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC(4, 16)
#define LPC24XX_PIN_EMC_A_0_17 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 17)
#define LPC24XX_PIN_EMC_A_0_18 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 18)
#define LPC24XX_PIN_EMC_A_0_19 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 19)
#define LPC24XX_PIN_EMC_A_0_20 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 20)
#define LPC24XX_PIN_EMC_A_0_21 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 21)
#define LPC24XX_PIN_EMC_A_0_22 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 22)
#define LPC24XX_PIN_EMC_A_0_23 \
  LPC24XX_PIN_EMC_A_0_15, \
  LPC24XX_PIN_EMC_RANGE(4, 16, 23)
#define LPC24XX_PIN_EMC_A_0_24 \
  LPC24XX_PIN_EMC_A_0_23, \
  LPC24XX_PIN_EMC(5, 24)
#define LPC24XX_PIN_EMC_A_0_25 \
  LPC24XX_PIN_EMC_A_0_23, \
  LPC24XX_PIN_EMC_RANGE(5, 24, 25)

/** @} */

/**
 * @name I2C 0 Pins
 *
 * @{
 */

#define LPC24XX_PIN_I2C_0_SDA \
  LPC24XX_PIN_WITH_TYPE(0, 27, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_0_SCL \
  LPC24XX_PIN_WITH_TYPE(0, 28, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_I2C)

/** @} */

/**
 * @name I2C 1 Pins
 *
 * @{
 */

#define LPC24XX_PIN_I2C_1_SDA_P0_0 \
  LPC24XX_PIN_WITH_TYPE(0, 0, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_1_SDA_P0_19 \
  LPC24XX_PIN_WITH_TYPE(0, 19, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_1_SDA_P2_14 \
  LPC24XX_PIN_WITH_TYPE(2, 14, LPC24XX_PIN_FUNCTION_11, 2, LPC17XX_PIN_TYPE_I2C)

