RTEMS/rtems/bsps/arm/lpc24xx/include/bsp/io.h
#define LPC24XX_PIN_I2C_1_SCL_P0_1 \
  LPC24XX_PIN_WITH_TYPE(0, 1, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_1_SCL_P0_20 \
  LPC24XX_PIN_WITH_TYPE(0, 20, LPC24XX_PIN_FUNCTION_11, 3, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_1_SCL_P2_15 \
  LPC24XX_PIN_WITH_TYPE(2, 15, LPC24XX_PIN_FUNCTION_11, 2, LPC17XX_PIN_TYPE_I2C)

/** @} */

/**
 * @name I2C 2 Pins
 *
 * @{
 */

#define LPC24XX_PIN_I2C_2_SDA_P0_10 \
  LPC24XX_PIN_WITH_TYPE(0, 10, LPC24XX_PIN_FUNCTION_10, 2, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_2_SDA_P2_30 \
  LPC24XX_PIN_WITH_TYPE(2, 30, LPC24XX_PIN_FUNCTION_11, 2, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_2_SDA_P4_20 \
  LPC24XX_PIN_WITH_TYPE(4, 20, LPC24XX_PIN_FUNCTION_10, 2, LPC17XX_PIN_TYPE_I2C)

#define LPC24XX_PIN_I2C_2_SCL_P0_11 \
  LPC24XX_PIN_WITH_TYPE(0, 11, LPC24XX_PIN_FUNCTION_10, 2, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_2_SCL_P2_31 \
  LPC24XX_PIN_WITH_TYPE(2, 31, LPC24XX_PIN_FUNCTION_11, 2, LPC17XX_PIN_TYPE_I2C)
#define LPC24XX_PIN_I2C_2_SCL_P4_21 \
  LPC24XX_PIN_WITH_TYPE(4, 21, LPC24XX_PIN_FUNCTION_10, 2, LPC17XX_PIN_TYPE_I2C)

/** @} */

/**
 * @name I2S Pins
 *
 * @{
 */

#define LPC24XX_PIN_I2S_RX_CLK_P0_4 \
  LPC24XX_PIN(0, 4, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_I2S_RX_CLK_P0_23 \
  LPC24XX_PIN(0, 23, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_I2S_RX_WS_P0_5 \
  LPC24XX_PIN(0, 5, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_I2S_RX_WS_P0_24 \
  LPC24XX_PIN(0, 24, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_I2S_RX_SDA_P0_6 \
  LPC24XX_PIN(0, 6, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_I2S_RX_SDA_P0_25 \
  LPC24XX_PIN(0, 25, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_I2S_TX_CLK_P0_7 \
  LPC24XX_PIN(0, 7, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_I2S_TX_CLK_P2_11 \
  LPC24XX_PIN(2, 11, LPC24XX_PIN_FUNCTION_11, 3)

#define LPC24XX_PIN_I2S_TX_WS_P0_8 \
  LPC24XX_PIN(0, 8, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_I2S_TX_WS_P2_12 \
  LPC24XX_PIN(2, 12, LPC24XX_PIN_FUNCTION_11, 3)

#define LPC24XX_PIN_I2S_TX_SDA_P0_9 \
  LPC24XX_PIN(0, 9, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_I2S_TX_SDA_P2_13 \
  LPC24XX_PIN(2, 13, LPC24XX_PIN_FUNCTION_11, 3)

/** @} */

/**
 * @name LCD Pins
 *
 * @{
 */

#define LPC24XX_PIN_LCD_PWR \
  LPC24XX_PIN(2, 0, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_LE \
  LPC24XX_PIN(2, 1, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_DCLK \
  LPC24XX_PIN(2, 2, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_FP \
  LPC24XX_PIN(2, 3, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_ENAB_M \
  LPC24XX_PIN(2, 4, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_LP \
  LPC24XX_PIN(2, 5, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_CLKIN \
  LPC24XX_PIN(2, 11, LPC24XX_PIN_FUNCTION_01, 7)

#define LPC24XX_PIN_LCD_VD_0_P0_4 \
  LPC24XX_PIN(0, 4, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_0_P2_6 \
  LPC24XX_PIN(2, 6, LPC24XX_PIN_FUNCTION_11, 6)
#define LPC24XX_PIN_LCD_VD_1_P0_5 \
  LPC24XX_PIN(0, 5, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_1_P2_7 \
  LPC24XX_PIN(2, 7, LPC24XX_PIN_FUNCTION_11, 6)
#define LPC24XX_PIN_LCD_VD_2_P2_8 \
  LPC24XX_PIN(2, 8, LPC24XX_PIN_FUNCTION_11, 6)
#define LPC24XX_PIN_LCD_VD_2_P4_28 \
  LPC24XX_PIN(4, 28, LPC24XX_PIN_FUNCTION_10, 7)
#define LPC24XX_PIN_LCD_VD_3_P2_9 \
  LPC24XX_PIN(2, 9, LPC24XX_PIN_FUNCTION_11, 6)
#define LPC24XX_PIN_LCD_VD_3_P2_12 \
  LPC24XX_PIN(2, 12, LPC24XX_PIN_FUNCTION_01, 5)
#define LPC24XX_PIN_LCD_VD_3_P4_29 \
  LPC24XX_PIN(4, 29, LPC24XX_PIN_FUNCTION_10, 7)
#define LPC24XX_PIN_LCD_VD_4_P2_6 \
  LPC24XX_PIN(2, 6, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_VD_4_P2_12 \
  LPC24XX_PIN(2, 12, LPC24XX_PIN_FUNCTION_01, 4)
#define LPC24XX_PIN_LCD_VD_5_P2_7 \
  LPC24XX_PIN(2, 7, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_VD_5_P2_13 \
  LPC24XX_PIN(2, 13, LPC24XX_PIN_FUNCTION_01, 5)
#define LPC24XX_PIN_LCD_VD_6_P1_20 \
  LPC24XX_PIN(1, 20, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_6_P2_8 \
  LPC24XX_PIN(2, 8, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_VD_6_P4_28 \
  LPC24XX_PIN(4, 28, LPC24XX_PIN_FUNCTION_10, 5)
#define LPC24XX_PIN_LCD_VD_7_P1_21 \
  LPC24XX_PIN(1, 21, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_7_P2_9 \
  LPC24XX_PIN(2, 9, LPC24XX_PIN_FUNCTION_11, 7)
#define LPC24XX_PIN_LCD_VD_7_P4_29 \
  LPC24XX_PIN(4, 29, LPC24XX_PIN_FUNCTION_10, 5)
#define LPC24XX_PIN_LCD_VD_8_P0_6 \
  LPC24XX_PIN(0, 6, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_8_P1_22 \
  LPC24XX_PIN(1, 22, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_8_P2_12 \
  LPC24XX_PIN(2, 12, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_9_P0_7 \
  LPC24XX_PIN(0, 7, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_9_P1_23 \
  LPC24XX_PIN(1, 23, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_9_P2_13 \
  LPC24XX_PIN(2, 13, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_10_P1_20 \
  LPC24XX_PIN(1, 20, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_10_P1_24 \
  LPC24XX_PIN(1, 24, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_10_P4_28 \
  LPC24XX_PIN(4, 28, LPC24XX_PIN_FUNCTION_10, 6)
#define LPC24XX_PIN_LCD_VD_11_P1_21 \
  LPC24XX_PIN(1, 21, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_11_P1_25 \
  LPC24XX_PIN(1, 25, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_11_P4_29 \
  LPC24XX_PIN(4, 29, LPC24XX_PIN_FUNCTION_10, 6)
#define LPC24XX_PIN_LCD_VD_12_P1_22 \
  LPC24XX_PIN(1, 22, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_12_P1_26 \
  LPC24XX_PIN(1, 26, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_13_P1_23 \
  LPC24XX_PIN(1, 23, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_13_P1_27 \
  LPC24XX_PIN(1, 27, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_14_P1_24 \
  LPC24XX_PIN(1, 24, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_14_P1_28 \
  LPC24XX_PIN(1, 28, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_15_P1_25 \
  LPC24XX_PIN(1, 25, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_15_P1_29 \
  LPC24XX_PIN(1, 29, LPC24XX_PIN_FUNCTION_01, 6)
#define LPC24XX_PIN_LCD_VD_16_P0_8 \
  LPC24XX_PIN(0, 8, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_17_P0_9 \
  LPC24XX_PIN(0, 9, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_18_P2_12 \
  LPC24XX_PIN(2, 12, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_19_P2_13 \
  LPC24XX_PIN(2, 13, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_20_P1_26 \
  LPC24XX_PIN(1, 26, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_21_P1_27 \
  LPC24XX_PIN(1, 27, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_22_P1_28 \
  LPC24XX_PIN(1, 28, LPC24XX_PIN_FUNCTION_01, 7)
#define LPC24XX_PIN_LCD_VD_23_P1_29 \
  LPC24XX_PIN(1, 29, LPC24XX_PIN_FUNCTION_01, 7)

/** @} */

/**
 * @name PWM 0 Pins
 *
 * @{
 */

#define LPC24XX_PIN_PWM_0_CHANNEL_1_P1_2 \
  LPC24XX_PIN(1, 2, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CHANNEL_1_P3_16 \
  LPC24XX_PIN(3, 16, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_PWM_0_CHANNEL_2_P1_3 \
  LPC24XX_PIN(1, 3, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CHANNEL_2_P3_17 \
  LPC24XX_PIN(3, 17, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_PWM_0_CHANNEL_3_P1_5 \
  LPC24XX_PIN(1, 5, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CHANNEL_3_P3_18 \
  LPC24XX_PIN(3, 18, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_PWM_0_CHANNEL_4_P1_6 \
  LPC24XX_PIN(1, 6, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CHANNEL_4_P3_19 \
  LPC24XX_PIN(3, 19, LPC24XX_PIN_FUNCTION_10, 2)

