RTEMS/rtems/bsps/arm/lpc24xx/include/bsp/io.h
#define LPC24XX_PIN_PWM_0_CHANNEL_5_P1_7 \
  LPC24XX_PIN(1, 7, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CHANNEL_5_P3_20 \
  LPC24XX_PIN(3, 20, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_PWM_0_CHANNEL_6_P1_11 \
  LPC24XX_PIN(1, 11, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CHANNEL_6_P3_21 \
  LPC24XX_PIN(3, 21, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_PWM_0_CAPTURE_0_P1_12 \
  LPC24XX_PIN(1, 12, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_PWM_0_CAPTURE_0_P3_22 \
  LPC24XX_PIN(3, 22, LPC24XX_PIN_FUNCTION_10, 2)

/** @} */

/**
 * @name PWM 1 Pins
 *
 * @{
 */

#define LPC24XX_PIN_PWM_1_CHANNEL_1_P1_18 \
  LPC24XX_PIN(1, 18, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CHANNEL_1_P2_0 \
  LPC24XX_PIN(2, 0, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CHANNEL_1_P3_24 \
  LPC24XX_PIN(3, 24, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_PWM_1_CHANNEL_2_P1_20 \
  LPC24XX_PIN(1, 20, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CHANNEL_2_P2_1 \
  LPC24XX_PIN(2, 1, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CHANNEL_2_P3_25 \
  LPC24XX_PIN(3, 25, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_PWM_1_CHANNEL_3_P1_21 \
  LPC24XX_PIN(1, 21, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CHANNEL_3_P2_2 \
  LPC24XX_PIN(2, 2, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CHANNEL_3_P3_26 \
  LPC24XX_PIN(3, 26, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_PWM_1_CHANNEL_4_P1_23 \
  LPC24XX_PIN(1, 23, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CHANNEL_4_P2_3 \
  LPC24XX_PIN(2, 3, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CHANNEL_4_P3_27 \
  LPC24XX_PIN(3, 27, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_PWM_1_CHANNEL_5_P1_24 \
  LPC24XX_PIN(1, 24, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CHANNEL_5_P2_4 \
  LPC24XX_PIN(2, 4, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CHANNEL_5_P3_28 \
  LPC24XX_PIN(3, 28, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_PWM_1_CHANNEL_6_P1_26 \
  LPC24XX_PIN(1, 26, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CHANNEL_6_P2_5 \
  LPC24XX_PIN(2, 5, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CHANNEL_6_P3_29 \
  LPC24XX_PIN(3, 29, LPC24XX_PIN_FUNCTIO9_11, 2)

#define LPC24XX_PIN_PWM_1_CAPTURE_0_P1_28 \
  LPC24XX_PIN(1, 28, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_PWM_1_CAPTURE_0_P2_7 \
  LPC24XX_PIN(2, 6, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_PWM_1_CAPTURE_0_P3_23 \
  LPC24XX_PIN(3, 23, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_PWM_1_CAPTURE_1_P1_29 \
  LPC24XX_PIN(1, 29, LPC24XX_PIN_FUNCTION_10, 2)

/** @} */

#ifdef ARM_MULTILIB_ARCH_V4

/**
 * @name SPI Pins
 *
 * @{
 */

#define LPC24XX_PIN_SPI_SCK \
  LPC24XX_PIN(0, 15, LPC24XX_PIN_FUNCTION_11)
#define LPC24XX_PIN_SPI_SSEL \
  LPC24XX_PIN(0, 16, LPC24XX_PIN_FUNCTION_11)
#define LPC24XX_PIN_SPI_MISO \
  LPC24XX_PIN(0, 17, LPC24XX_PIN_FUNCTION_11)
#define LPC24XX_PIN_SPI_MOSI \
  LPC24XX_PIN(0, 18, LPC24XX_PIN_FUNCTION_11)

/** @} */

#endif /* ARM_MULTILIB_ARCH_V4 */

/**
 * @name SSP 0 Pins
 *
 * @{
 */

#define LPC24XX_PIN_SSP_0_SCK_P0_15 \
  LPC24XX_PIN(0, 15, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_0_SCK_P1_20 \
  LPC24XX_PIN(1, 20, LPC24XX_PIN_FUNCTION_11, 5)
#define LPC24XX_PIN_SSP_0_SCK_P2_22 \
  LPC24XX_PIN(2, 22, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_SSP_0_SSEL_P0_16 \
  LPC24XX_PIN(0, 16, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_0_SSEL_P1_21 \
  LPC24XX_PIN(1, 21, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_SSP_0_SSEL_P2_23 \
  LPC24XX_PIN(2, 23, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_SSP_0_MISO_P0_17 \
  LPC24XX_PIN(0, 17, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_0_MISO_P1_23 \
  LPC24XX_PIN(1, 23, LPC24XX_PIN_FUNCTION_11, 5)
#define LPC24XX_PIN_SSP_0_MISO_P2_26 \
  LPC24XX_PIN(2, 26, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_SSP_0_MOSI_P0_18 \
  LPC24XX_PIN(0, 18, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_0_MOSI_P1_24 \
  LPC24XX_PIN(1, 24, LPC24XX_PIN_FUNCTION_11, 5)
#define LPC24XX_PIN_SSP_0_MOSI_P2_27 \
  LPC24XX_PIN(2, 27, LPC24XX_PIN_FUNCTION_11, 2)

/** @} */

/**
 * @name SSP 1 Pins
 *
 * @{
 */

#define LPC24XX_PIN_SSP_1_SCK_P0_6 \
  LPC24XX_PIN(0, 7, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_SCK_P0_12 \
  LPC24XX_PIN(1, 31, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_SCK_P4_20 \
  LPC24XX_PIN(4, 20, LPC24XX_PIN_FUNCTION_11, 3)

#define LPC24XX_PIN_SSP_1_SSEL_P0_7 \
  LPC24XX_PIN(0, 6, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_SSEL_P0_13 \
  LPC24XX_PIN(0, 14, LPC24XX_PIN_FUNCTION_11, 2)
#define LPC24XX_PIN_SSP_1_SSEL_P4_21 \
  LPC24XX_PIN(4, 21, LPC24XX_PIN_FUNCTION_11, 3)

#define LPC24XX_PIN_SSP_1_MISO_P0_8 \
  LPC24XX_PIN(0, 8, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_MISO_P0_14 \
  LPC24XX_PIN(0, 12, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_MISO_P4_22 \
  LPC24XX_PIN(4, 22, LPC24XX_PIN_FUNCTION_11, 3)

#define LPC24XX_PIN_SSP_1_MOSI_P0_9 \
  LPC24XX_PIN(0, 9, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_MOSI_P1_31 \
  LPC24XX_PIN(0, 13, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_SSP_1_MOSI_P4_23 \
  LPC24XX_PIN(4, 23, LPC24XX_PIN_FUNCTION_11, 3)

/** @} */

#ifdef ARM_MULTILIB_ARCH_V7M

/**
 * @name SSP 2 Pins
 *
 * @{
 */

#define LPC24XX_PIN_SSP_2_SCK_P1_0 \
  LPC24XX_PIN(1, 0, LPC24XX_PIN_FUNCTION_00, 4)
#define LPC24XX_PIN_SSP_2_SCK_P5_2 \
  LPC24XX_PIN(5, 2, LPC24XX_PIN_FUNCTION_00, 2)

#define LPC24XX_PIN_SSP_2_SSEL_P1_8 \
  LPC24XX_PIN(1, 8, LPC24XX_PIN_FUNCTION_00, 4)
#define LPC24XX_PIN_SSP_2_SSEL_P5_3 \
  LPC24XX_PIN(5, 3, LPC24XX_PIN_FUNCTION_00, 2)

#define LPC24XX_PIN_SSP_2_MISO_P1_4 \
  LPC24XX_PIN(1, 4, LPC24XX_PIN_FUNCTION_00, 4)
#define LPC24XX_PIN_SSP_2_MISO_P5_1 \
  LPC24XX_PIN(5, 1, LPC24XX_PIN_FUNCTION_00, 2)

#define LPC24XX_PIN_SSP_2_MOSI_P1_1 \
  LPC24XX_PIN(1, 1, LPC24XX_PIN_FUNCTION_00, 4)
#define LPC24XX_PIN_SSP_2_MOSI_P5_0 \
  LPC24XX_PIN(5, 0, LPC24XX_PIN_FUNCTION_00, 2)

/** @} */

#endif /* ARM_MULTILIB_ARCH_V7M */

/**
 * @name UART 0 Pins
 *
 * @{
 */

#define LPC24XX_PIN_UART_0_TXD \
  LPC24XX_PIN(0, 2, LPC24XX_PIN_FUNCTION_01, 1)

#define LPC24XX_PIN_UART_0_RXD \
  LPC24XX_PIN(0, 3, LPC24XX_PIN_FUNCTION_01, 1)

/** @} */

/**
 * @name UART 1 Pins
 *
 * @{
 */

