RTEMS/rtems/bsps/arm/lpc24xx/include/bsp/io.h
#define LPC24XX_PIN_UART_1_TXD_P0_15 \
  LPC24XX_PIN(0, 15, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_UART_1_TXD_P2_0 \
  LPC24XX_PIN(2, 0, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_UART_1_TXD_P3_16 \
  LPC24XX_PIN(3, 16, LPC24XX_PIN_FUNCTION_11, 3)

#define LPC24XX_PIN_UART_1_RXD_P0_16 \
  LPC24XX_PIN(0, 16, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_UART_1_RXD_P2_1 \
  LPC24XX_PIN(2, 1, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_UART_1_RXD_P3_17 \
  LPC24XX_PIN(3, 17, LPC24XX_PIN_FUNCTION_11, 3)

/** @} */

/**
 * @name UART 2 Pins
 *
 * @{
 */

#define LPC24XX_PIN_UART_2_TXD_P0_10 \
  LPC24XX_PIN(0, 10, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_UART_2_TXD_P2_8 \
  LPC24XX_PIN(2, 8, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_UART_2_TXD_P4_22 \
  LPC24XX_PIN(4, 22, LPC24XX_PIN_FUNCTION_10, 2)

#define LPC24XX_PIN_UART_2_RXD_P0_11 \
  LPC24XX_PIN(0, 11, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_UART_2_RXD_P2_9 \
  LPC24XX_PIN(2, 9, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_UART_2_RXD_P4_23 \
  LPC24XX_PIN(4, 23, LPC24XX_PIN_FUNCTION_10, 2)

/** @} */

/**
 * @name UART 3 Pins
 *
 * @{
 */

#define LPC24XX_PIN_UART_3_TXD_P0_0 \
  LPC24XX_PIN(0, 0, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_UART_3_TXD_P0_25 \
  LPC24XX_PIN(0, 25, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_UART_3_TXD_P4_28 \
  LPC24XX_PIN(4, 28, LPC24XX_PIN_FUNCTION_11, 2)

#define LPC24XX_PIN_UART_3_RXD_P0_1 \
  LPC24XX_PIN(0, 1, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_UART_3_RXD_P0_26 \
  LPC24XX_PIN(0, 26, LPC24XX_PIN_FUNCTION_11, 3)
#define LPC24XX_PIN_UART_3_RXD_P4_29 \
  LPC24XX_PIN(4, 29, LPC24XX_PIN_FUNCTION_11, 2)

/** @} */

#ifdef ARM_MULTILIB_ARCH_V7M

/**
 * @name UART 4 Pins
 *
 * @{
 */

#define LPC24XX_PIN_UART_4_TXD_P0_22 \
  LPC24XX_PIN(0, 22, LPC24XX_PIN_FUNCTION_00, 3)
#define LPC24XX_PIN_UART_4_TXD_P1_29 \
  LPC24XX_PIN(1, 29, LPC24XX_PIN_FUNCTION_00, 5)
#define LPC24XX_PIN_UART_4_TXD_P5_4 \
  LPC24XX_PIN(5, 4, LPC24XX_PIN_FUNCTION_00, 4)

#define LPC24XX_PIN_UART_4_RXD_P2_9 \
  LPC24XX_PIN(2, 9, LPC24XX_PIN_FUNCTION_00, 3)
#define LPC24XX_PIN_UART_4_RXD_P5_3 \
  LPC24XX_PIN(5, 3, LPC24XX_PIN_FUNCTION_00, 4)

#define LPC24XX_PIN_UART_4_OE_P0_21 \
  LPC24XX_PIN(0, 21, LPC24XX_PIN_FUNCTION_00, 3)

#define LPC24XX_PIN_UART_4_SCLK_P0_21 \
  LPC24XX_PIN(0, 21, LPC24XX_PIN_FUNCTION_00, 5)

#endif /* ARM_MULTILIB_ARCH_V7M */

/** @} */

/**
 * @name USB Port 1 Pins
 *
 * @{
 */

#define LPC24XX_PIN_USB_D_PLUS_1\
  LPC24XX_PIN(0, 29, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_D_MINUS_1\
  LPC24XX_PIN(0, 30, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_UP_LED_1\
  LPC24XX_PIN(1, 18, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_TX_E_1\
  LPC24XX_PIN(1, 19, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_PPWR_1\
  LPC24XX_PIN(1, 19, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_USB_TX_DP_1\
  LPC24XX_PIN(1, 20, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_TX_DM_1\
  LPC24XX_PIN(1, 21, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_RCV_1\
  LPC24XX_PIN(1, 22, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_PWRD_1\
  LPC24XX_PIN(1, 22, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_USB_RX_DP_1\
  LPC24XX_PIN(1, 23, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_RX_DM_1\
  LPC24XX_PIN(1, 24, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_LS_1\
  LPC24XX_PIN(1, 25, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_HSTEN_1\
  LPC24XX_PIN(1, 25, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_USB_SSPND_1\
  LPC24XX_PIN(1, 26, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_INT_1\
  LPC24XX_PIN(1, 27, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_OVRCR_1\
  LPC24XX_PIN(1, 27, LPC24XX_PIN_FUNCTION_10, 2)
#define LPC24XX_PIN_USB_SCL_1\
  LPC24XX_PIN(1, 28, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_SDA_1 \
  LPC24XX_PIN_WITH_TYPE( \
    1, 29, LPC24XX_PIN_FUNCTION_01, 1, LPC17XX_PIN_TYPE_OPEN_DRAIN \
  )
#define LPC24XX_PIN_USB_CONNECT_1\
  LPC24XX_PIN(2, 9, LPC24XX_PIN_FUNCTION_01, 1)

/** @} */

/**
 * @name USB Port 2 Pins
 *
 * @{
 */

#define LPC24XX_PIN_USB_PPWR_2\
  LPC24XX_PIN(0, 12, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_UP_LED_2\
  LPC24XX_PIN(0, 13, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_HSTEN_2\
  LPC24XX_PIN(0, 14, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_CONNECT_2\
  LPC24XX_PIN(0, 14, LPC24XX_PIN_FUNCTION_01, 3)
#define LPC24XX_PIN_USB_D_PLUS_2\
  LPC24XX_PIN(0, 31, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_PWRD_2\
  LPC24XX_PIN(1, 30, LPC24XX_PIN_FUNCTION_01, 1)
#define LPC24XX_PIN_USB_OVRCR_2\
  LPC24XX_PIN(1, 31, LPC24XX_PIN_FUNCTION_01, 1)

/** @} */

/** @} */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* LIBBSP_ARM_LPC24XX_IO_H */
